//
// Created by Stefan Andonov on 11/11/21.
//Во една наградна игра имате можност да учествувате на 2 начина.
// Првиот е да кажете 6-цифрен природен број и ќе добиете награда ако тој е делив со 7,
// а вториот е да кажете N природни броеви, и добивате награда ако нивниот збир е делив со 7.
//
//Во оваа задача, на почеток како влез се внесува еден број, 1 или 2. Во зависност од тоа:
//
//Ако е внесен бројот 1, тоа означува дека внесуваме еден шестцифрен природен број и се внесува бројот.
//Ако е внесен бројот 2, тоа означува дека ќе внесуваме повеќе броеви и се внесува прво природен број
// N - колку броеви ќе внесуваме, а потоа N различни природни броеви.
//Ваша задача е на излез да испечатите DA, ако наградата е добиена (соодветниот број е делив со 7),
// односно NE ако наградата не е добиена. Во случај ако наградата не е добиена, да се испечати и остатокот при
// делењето на соодветниот број со 7.
//

#include<stdio.h>

int main (){
    int type; //1 ili 2
    int number;
    int i, n;
    scanf("%d", &type);

    if (type==1){
        scanf("%d", &number);
        if (number>=100000 && number<1000000) {
            if (number%7==0){
                printf("DA");
            } else {
                printf("NE %d", number%7);
            }
        } else {
            printf("NE");
        }

    } else {
        int sum = 0;
        scanf("%d", &n);
        for (i=1;i<=n;i++){
            scanf("%d", &number);
            sum+=number;
        }

        if (sum%7==0){
            printf("DA");
        } else {
            printf("NE %d", sum%7);
        }
    }
    return 0;
}

