//
// Created by Stefan Andonov on 11/10/21.
// 1a. Да се напише програма за пресметување на сумата на сите парни двоцифрени броеви.
// Добиената сума се печати на екран.
// 1b. Да се напише програма за пресметување на сумата на сите непарни двоцифрени броеви.
// Програмата ја печати сумата на екран во следниот формат:
// 11 + 13 + 15 + 17 + ... + 97 + 99 = 2475
//

#include<stdio.h>

int main() {
    int i, sum = 0;
    for (i = 10; i <= 98; i += 2) {
        sum += i;
    }
    printf("Sum of even two-digit numbers: %d\n", sum);

    sum = 0;
    for (i = 11; i <= 99; i+=2) {
        sum += i;
        if (i==99){
            printf("%d", i);
        } else {
            printf("%d + ", i);
        }
    }
    printf(" = %d", sum);

    return 0;
}